; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 11862)
	(= (fuel plane1) 269)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at person1 city3)
	(at person2 city1)
	(at person3 city4)
	(at person4 city6)
	(at person5 city4)
	(at person6 city1)
	(at person7 city5)
	(at person8 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 709)
	(= (distance city0 city2) 959)
	(= (distance city0 city3) 925)
	(= (distance city0 city4) 983)
	(= (distance city0 city5) 628)
	(= (distance city0 city6) 555)
	(= (distance city0 city7) 790)
	(= (distance city0 city8) 928)
	(= (distance city0 city9) 762)
	(= (distance city1 city0) 709)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 945)
	(= (distance city1 city3) 787)
	(= (distance city1 city4) 664)
	(= (distance city1 city5) 825)
	(= (distance city1 city6) 639)
	(= (distance city1 city7) 712)
	(= (distance city1 city8) 688)
	(= (distance city1 city9) 790)
	(= (distance city2 city0) 959)
	(= (distance city2 city1) 945)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 684)
	(= (distance city2 city4) 661)
	(= (distance city2 city5) 654)
	(= (distance city2 city6) 789)
	(= (distance city2 city7) 960)
	(= (distance city2 city8) 961)
	(= (distance city2 city9) 844)
	(= (distance city3 city0) 925)
	(= (distance city3 city1) 787)
	(= (distance city3 city2) 684)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 567)
	(= (distance city3 city5) 554)
	(= (distance city3 city6) 924)
	(= (distance city3 city7) 721)
	(= (distance city3 city8) 921)
	(= (distance city3 city9) 747)
	(= (distance city4 city0) 983)
	(= (distance city4 city1) 664)
	(= (distance city4 city2) 661)
	(= (distance city4 city3) 567)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 671)
	(= (distance city4 city6) 631)
	(= (distance city4 city7) 707)
	(= (distance city4 city8) 596)
	(= (distance city4 city9) 615)
	(= (distance city5 city0) 628)
	(= (distance city5 city1) 825)
	(= (distance city5 city2) 654)
	(= (distance city5 city3) 554)
	(= (distance city5 city4) 671)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 835)
	(= (distance city5 city7) 651)
	(= (distance city5 city8) 906)
	(= (distance city5 city9) 763)
	(= (distance city6 city0) 555)
	(= (distance city6 city1) 639)
	(= (distance city6 city2) 789)
	(= (distance city6 city3) 924)
	(= (distance city6 city4) 631)
	(= (distance city6 city5) 835)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 913)
	(= (distance city6 city8) 851)
	(= (distance city6 city9) 551)
	(= (distance city7 city0) 790)
	(= (distance city7 city1) 712)
	(= (distance city7 city2) 960)
	(= (distance city7 city3) 721)
	(= (distance city7 city4) 707)
	(= (distance city7 city5) 651)
	(= (distance city7 city6) 913)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 578)
	(= (distance city7 city9) 677)
	(= (distance city8 city0) 928)
	(= (distance city8 city1) 688)
	(= (distance city8 city2) 961)
	(= (distance city8 city3) 921)
	(= (distance city8 city4) 596)
	(= (distance city8 city5) 906)
	(= (distance city8 city6) 851)
	(= (distance city8 city7) 578)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 690)
	(= (distance city9 city0) 762)
	(= (distance city9 city1) 790)
	(= (distance city9 city2) 844)
	(= (distance city9 city3) 747)
	(= (distance city9 city4) 615)
	(= (distance city9 city5) 763)
	(= (distance city9 city6) 551)
	(= (distance city9 city7) 677)
	(= (distance city9 city8) 690)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city5)
	(at person3 city9)
	(at person4 city6)
	(at person5 city1)
	(at person6 city2)
	(at person7 city6)
	(at person8 city6)
	))

(:metric minimize (+ (* 5 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person7 plane1 city5)
   deleted: (at person7 city5)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 8
2. (refuel plane1 city5)
   changed: (fuel plane1) from 269 to 11862
   goals met: 1 of 8
3. (fly plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 0 to 4175, (fuel plane1) from 11862 to 7687
   goals met: 1 of 8
4. (debark person7 plane1 city6)
   deleted: (in person7 plane1)
   added: (at person7 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 8
5. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4175 to 6950, (fuel plane1) from 7687 to 4912
   goals met: 2 of 8
6. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 6950 to 11575, (fuel plane1) from 4912 to 287
   goals met: 2 of 8
7. (board person1 plane1 city3)
   deleted: (at person1 city3)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 8
8. (refuel plane1 city3)
   changed: (fuel plane1) from 287 to 11862
   goals met: 2 of 8
9. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 11575 to 16200, (fuel plane1) from 11862 to 7237
   goals met: 2 of 8
10. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
11. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 16200 to 20995, (fuel plane1) from 7237 to 2442
   goals met: 3 of 8
12. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
13. (refuel plane1 city2)
   changed: (fuel plane1) from 2442 to 11862
   goals met: 3 of 8
14. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 20995 to 24940, (fuel plane1) from 11862 to 7917
   goals met: 3 of 8
15. (debark person8 plane1 city6)
   deleted: (in person8 plane1)
   added: (at person8 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 8
16. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 24940 to 28095, (fuel plane1) from 7917 to 4762
   goals met: 4 of 8
17. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 8
18. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 8
19. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 28095 to 31450, (fuel plane1) from 4762 to 1407
   goals met: 4 of 8
20. (refuel plane1 city5)
   changed: (fuel plane1) from 1407 to 11862
   goals met: 4 of 8
21. (fly plane1 city5 city9)
   deleted: (at plane1 city5)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 31450 to 35265, (fuel plane1) from 11862 to 8047
   goals met: 4 of 8
22. (debark person3 plane1 city9)
   deleted: (in person3 plane1)
   added: (at person3 city9)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
23. (fly plane1 city9 city5)
   deleted: (at plane1 city9)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 35265 to 39080, (fuel plane1) from 8047 to 4232
   goals met: 5 of 8
24. (fly plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 39080 to 43205, (fuel plane1) from 4232 to 107
   goals met: 5 of 8
25. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
26. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 8
27. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 8
28. (refuel plane1 city1)
   changed: (fuel plane1) from 107 to 11862
   goals met: 6 of 8
29. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 43205 to 47330, (fuel plane1) from 11862 to 7737
   goals met: 6 of 8
30. (debark person2 plane1 city5)
   deleted: (in person2 plane1)
   added: (at person2 city5)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 8
31. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 47330 to 50600, (fuel plane1) from 7737 to 4467
   goals met: 7 of 8
32. (debark person6 plane1 city2)
   deleted: (in person6 plane1)
   added: (at person6 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
